balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F448.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n--nnnn" edc:cname="TXB0DLC" edc:desc="" edc:impl="0x4f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-u--uuuu" edc:name="TXB0DLC" edc:nzwidth="0x8" edc:por="-x--xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D00" edc:desc="" edc:mask="0x1" edc:name="TXB0D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D01" edc:desc="" edc:mask="0x1" edc:name="TXB0D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D02" edc:desc="" edc:mask="0x1" edc:name="TXB0D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D03" edc:desc="" edc:mask="0x1" edc:name="TXB0D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D04" edc:desc="" edc:mask="0x1" edc:name="TXB0D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D05" edc:desc="" edc:mask="0x1" edc:name="TXB0D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D06" edc:desc="" edc:mask="0x1" edc:name="TXB0D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D07" edc:desc="" edc:mask="0x1" edc:name="TXB0D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D10" edc:desc="" edc:mask="0x1" edc:name="TXB0D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D11" edc:desc="" edc:mask="0x1" edc:name="TXB0D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D12" edc:desc="" edc:mask="0x1" edc:name="TXB0D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D13" edc:desc="" edc:mask="0x1" edc:name="TXB0D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D14" edc:desc="" edc:mask="0x1" edc:name="TXB0D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D15" edc:desc="" edc:mask="0x1" edc:name="TXB0D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D16" edc:desc="" edc:mask="0x1" edc:name="TXB0D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D17" edc:desc="" edc:mask="0x1" edc:name="TXB0D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D20" edc:desc="" edc:mask="0x1" edc:name="TXB0D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D21" edc:desc="" edc:mask="0x1" edc:name="TXB0D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D22" edc:desc="" edc:mask="0x1" edc:name="TXB0D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D23" edc:desc="" edc:mask="0x1" edc:name="TXB0D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D24" edc:desc="" edc:mask="0x1" edc:name="TXB0D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D25" edc:desc="" edc:mask="0x1" edc:name="TXB0D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D26" edc:desc="" edc:mask="0x1" edc:name="TXB0D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D27" edc:desc="" edc:mask="0x1" edc:name="TXB0D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D30" edc:desc="" edc:mask="0x1" edc:name="TXB0D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D31" edc:desc="" edc:mask="0x1" edc:name="TXB0D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D32" edc:desc="" edc:mask="0x1" edc:name="TXB0D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D33" edc:desc="" edc:mask="0x1" edc:name="TXB0D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D34" edc:desc="" edc:mask="0x1" edc:name="TXB0D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D35" edc:desc="" edc:mask="0x1" edc:name="TXB0D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D36" edc:desc="" edc:mask="0x1" edc:name="TXB0D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D37" edc:desc="" edc:mask="0x1" edc:name="TXB0D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D40" edc:desc="" edc:mask="0x1" edc:name="TXB0D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D41" edc:desc="" edc:mask="0x1" edc:name="TXB0D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D42" edc:desc="" edc:mask="0x1" edc:name="TXB0D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D43" edc:desc="" edc:mask="0x1" edc:name="TXB0D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D44" edc:desc="" edc:mask="0x1" edc:name="TXB0D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D45" edc:desc="" edc:mask="0x1" edc:name="TXB0D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D46" edc:desc="" edc:mask="0x1" edc:name="TXB0D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D47" edc:desc="" edc:mask="0x1" edc:name="TXB0D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D50" edc:desc="" edc:mask="0x1" edc:name="TXB0D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D51" edc:desc="" edc:mask="0x1" edc:name="TXB0D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D52" edc:desc="" edc:mask="0x1" edc:name="TXB0D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D53" edc:desc="" edc:mask="0x1" edc:name="TXB0D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D54" edc:desc="" edc:mask="0x1" edc:name="TXB0D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D55" edc:desc="" edc:mask="0x1" edc:name="TXB0D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D56" edc:desc="" edc:mask="0x1" edc:name="TXB0D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D57" edc:desc="" edc:mask="0x1" edc:name="TXB0D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D60" edc:desc="" edc:mask="0x1" edc:name="TXB0D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D61" edc:desc="" edc:mask="0x1" edc:name="TXB0D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D62" edc:desc="" edc:mask="0x1" edc:name="TXB0D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D63" edc:desc="" edc:mask="0x1" edc:name="TXB0D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D64" edc:desc="" edc:mask="0x1" edc:name="TXB0D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D65" edc:desc="" edc:mask="0x1" edc:name="TXB0D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D66" edc:desc="" edc:mask="0x1" edc:name="TXB0D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D67" edc:desc="" edc:mask="0x1" edc:name="TXB0D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D70" edc:desc="" edc:mask="0x1" edc:name="TXB0D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D71" edc:desc="" edc:mask="0x1" edc:name="TXB0D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D72" edc:desc="" edc:mask="0x1" edc:name="TXB0D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D73" edc:desc="" edc:mask="0x1" edc:name="TXB0D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D74" edc:desc="" edc:mask="0x1" edc:name="TXB0D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D75" edc:desc="" edc:mask="0x1" edc:name="TXB0D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D76" edc:desc="" edc:mask="0x1" edc:name="TXB0D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D77" edc:desc="" edc:mask="0x1" edc:name="TXB0D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
