balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F448.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RXB0DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RXB0DLC" edc:nzwidth="0x8" edc:por="-xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESB0" edc:desc="" edc:mask="0x1" edc:name="RESB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESB1" edc:desc="" edc:mask="0x1" edc:name="RESB1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D00" edc:desc="" edc:mask="0x1" edc:name="RXB0D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D01" edc:desc="" edc:mask="0x1" edc:name="RXB0D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D02" edc:desc="" edc:mask="0x1" edc:name="RXB0D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D03" edc:desc="" edc:mask="0x1" edc:name="RXB0D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D04" edc:desc="" edc:mask="0x1" edc:name="RXB0D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D05" edc:desc="" edc:mask="0x1" edc:name="RXB0D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D06" edc:desc="" edc:mask="0x1" edc:name="RXB0D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D07" edc:desc="" edc:mask="0x1" edc:name="RXB0D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D00" edc:desc="" edc:mask="0x1" edc:name="RB0D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D01" edc:desc="" edc:mask="0x1" edc:name="RB0D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D02" edc:desc="" edc:mask="0x1" edc:name="RB0D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D03" edc:desc="" edc:mask="0x1" edc:name="RB0D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D04" edc:desc="" edc:mask="0x1" edc:name="RB0D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D05" edc:desc="" edc:mask="0x1" edc:name="RB0D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D06" edc:desc="" edc:mask="0x1" edc:name="RB0D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D07" edc:desc="" edc:mask="0x1" edc:name="RB0D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D10" edc:desc="" edc:mask="0x1" edc:name="RXB0D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D11" edc:desc="" edc:mask="0x1" edc:name="RXB0D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D12" edc:desc="" edc:mask="0x1" edc:name="RXB0D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D13" edc:desc="" edc:mask="0x1" edc:name="RXB0D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D14" edc:desc="" edc:mask="0x1" edc:name="RXB0D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D15" edc:desc="" edc:mask="0x1" edc:name="RXB0D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D16" edc:desc="" edc:mask="0x1" edc:name="RXB0D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D17" edc:desc="" edc:mask="0x1" edc:name="RXB0D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D10" edc:desc="" edc:mask="0x1" edc:name="RB0D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D11" edc:desc="" edc:mask="0x1" edc:name="RB0D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D12" edc:desc="" edc:mask="0x1" edc:name="RB0D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D13" edc:desc="" edc:mask="0x1" edc:name="RB0D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D14" edc:desc="" edc:mask="0x1" edc:name="RB0D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D15" edc:desc="" edc:mask="0x1" edc:name="RB0D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D16" edc:desc="" edc:mask="0x1" edc:name="RB0D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D17" edc:desc="" edc:mask="0x1" edc:name="RB0D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
