balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F448.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D20" edc:desc="" edc:mask="0x1" edc:name="RXB0D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D21" edc:desc="" edc:mask="0x1" edc:name="RXB0D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D22" edc:desc="" edc:mask="0x1" edc:name="RXB0D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D23" edc:desc="" edc:mask="0x1" edc:name="RXB0D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D24" edc:desc="" edc:mask="0x1" edc:name="RXB0D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D25" edc:desc="" edc:mask="0x1" edc:name="RXB0D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D26" edc:desc="" edc:mask="0x1" edc:name="RXB0D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D27" edc:desc="" edc:mask="0x1" edc:name="RXB0D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D20" edc:desc="" edc:mask="0x1" edc:name="RB0D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D21" edc:desc="" edc:mask="0x1" edc:name="RB0D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D22" edc:desc="" edc:mask="0x1" edc:name="RB0D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D23" edc:desc="" edc:mask="0x1" edc:name="RB0D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D24" edc:desc="" edc:mask="0x1" edc:name="RB0D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D25" edc:desc="" edc:mask="0x1" edc:name="RB0D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D26" edc:desc="" edc:mask="0x1" edc:name="RB0D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D27" edc:desc="" edc:mask="0x1" edc:name="RB0D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D30" edc:desc="" edc:mask="0x1" edc:name="RXB0D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D31" edc:desc="" edc:mask="0x1" edc:name="RXB0D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D32" edc:desc="" edc:mask="0x1" edc:name="RXB0D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D33" edc:desc="" edc:mask="0x1" edc:name="RXB0D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D34" edc:desc="" edc:mask="0x1" edc:name="RXB0D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D35" edc:desc="" edc:mask="0x1" edc:name="RXB0D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D36" edc:desc="" edc:mask="0x1" edc:name="RXB0D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D37" edc:desc="" edc:mask="0x1" edc:name="RXB0D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D30" edc:desc="" edc:mask="0x1" edc:name="RB0D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D31" edc:desc="" edc:mask="0x1" edc:name="RB0D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D32" edc:desc="" edc:mask="0x1" edc:name="RB0D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D33" edc:desc="" edc:mask="0x1" edc:name="RB0D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D34" edc:desc="" edc:mask="0x1" edc:name="RB0D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D35" edc:desc="" edc:mask="0x1" edc:name="RB0D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D36" edc:desc="" edc:mask="0x1" edc:name="RB0D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D37" edc:desc="" edc:mask="0x1" edc:name="RB0D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D40" edc:desc="" edc:mask="0x1" edc:name="RXB0D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D41" edc:desc="" edc:mask="0x1" edc:name="RXB0D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D42" edc:desc="" edc:mask="0x1" edc:name="RXB0D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D43" edc:desc="" edc:mask="0x1" edc:name="RXB0D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D44" edc:desc="" edc:mask="0x1" edc:name="RXB0D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D45" edc:desc="" edc:mask="0x1" edc:name="RXB0D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D46" edc:desc="" edc:mask="0x1" edc:name="RXB0D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D47" edc:desc="" edc:mask="0x1" edc:name="RXB0D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D40" edc:desc="" edc:mask="0x1" edc:name="RB0D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D41" edc:desc="" edc:mask="0x1" edc:name="RB0D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D42" edc:desc="" edc:mask="0x1" edc:name="RB0D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D43" edc:desc="" edc:mask="0x1" edc:name="RB0D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D44" edc:desc="" edc:mask="0x1" edc:name="RB0D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D45" edc:desc="" edc:mask="0x1" edc:name="RB0D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D46" edc:desc="" edc:mask="0x1" edc:name="RB0D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D47" edc:desc="" edc:mask="0x1" edc:name="RB0D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
