balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F448.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D50" edc:desc="" edc:mask="0x1" edc:name="RXB0D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D51" edc:desc="" edc:mask="0x1" edc:name="RXB0D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D52" edc:desc="" edc:mask="0x1" edc:name="RXB0D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D53" edc:desc="" edc:mask="0x1" edc:name="RXB0D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D54" edc:desc="" edc:mask="0x1" edc:name="RXB0D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D55" edc:desc="" edc:mask="0x1" edc:name="RXB0D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D56" edc:desc="" edc:mask="0x1" edc:name="RXB0D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D57" edc:desc="" edc:mask="0x1" edc:name="RXB0D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D50" edc:desc="" edc:mask="0x1" edc:name="RB0D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D51" edc:desc="" edc:mask="0x1" edc:name="RB0D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D52" edc:desc="" edc:mask="0x1" edc:name="RB0D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D53" edc:desc="" edc:mask="0x1" edc:name="RB0D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D54" edc:desc="" edc:mask="0x1" edc:name="RB0D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D55" edc:desc="" edc:mask="0x1" edc:name="RB0D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D56" edc:desc="" edc:mask="0x1" edc:name="RB0D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D57" edc:desc="" edc:mask="0x1" edc:name="RB0D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D60" edc:desc="" edc:mask="0x1" edc:name="RXB0D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D61" edc:desc="" edc:mask="0x1" edc:name="RXB0D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D62" edc:desc="" edc:mask="0x1" edc:name="RXB0D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D63" edc:desc="" edc:mask="0x1" edc:name="RXB0D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D64" edc:desc="" edc:mask="0x1" edc:name="RXB0D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D65" edc:desc="" edc:mask="0x1" edc:name="RXB0D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D66" edc:desc="" edc:mask="0x1" edc:name="RXB0D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D67" edc:desc="" edc:mask="0x1" edc:name="RXB0D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D60" edc:desc="" edc:mask="0x1" edc:name="RB0D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D61" edc:desc="" edc:mask="0x1" edc:name="RB0D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D62" edc:desc="" edc:mask="0x1" edc:name="RB0D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D63" edc:desc="" edc:mask="0x1" edc:name="RB0D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D64" edc:desc="" edc:mask="0x1" edc:name="RB0D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D65" edc:desc="" edc:mask="0x1" edc:name="RB0D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D66" edc:desc="" edc:mask="0x1" edc:name="RB0D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D67" edc:desc="" edc:mask="0x1" edc:name="RB0D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D70" edc:desc="" edc:mask="0x1" edc:name="RXB0D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D71" edc:desc="" edc:mask="0x1" edc:name="RXB0D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D72" edc:desc="" edc:mask="0x1" edc:name="RXB0D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D73" edc:desc="" edc:mask="0x1" edc:name="RXB0D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D74" edc:desc="" edc:mask="0x1" edc:name="RXB0D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D75" edc:desc="" edc:mask="0x1" edc:name="RXB0D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D76" edc:desc="" edc:mask="0x1" edc:name="RXB0D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D77" edc:desc="" edc:mask="0x1" edc:name="RXB0D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0D70" edc:desc="" edc:mask="0x1" edc:name="RB0D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D71" edc:desc="" edc:mask="0x1" edc:name="RB0D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D72" edc:desc="" edc:mask="0x1" edc:name="RB0D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D73" edc:desc="" edc:mask="0x1" edc:name="RB0D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D74" edc:desc="" edc:mask="0x1" edc:name="RB0D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D75" edc:desc="" edc:mask="0x1" edc:name="RB0D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D76" edc:desc="" edc:mask="0x1" edc:name="RB0D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0D77" edc:desc="" edc:mask="0x1" edc:name="RB0D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrr-rrr-" edc:cname="CANSTAT" edc:desc="" edc:impl="0xee" edc:isindirect="false" edc:isvolatile="true" edc:mclr="100-000-" edc:name="CANSTAT" edc:nzwidth="0x8" edc:por="100-000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
