balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F448.PIC
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="CANCON" edc:desc="" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1000000-" edc:name="CANCON" edc:nzwidth="0x8" edc:por="1000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="BRGCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="BRGCON1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BRP0" edc:desc="" edc:mask="0x1" edc:name="BRP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP1" edc:desc="" edc:mask="0x1" edc:name="BRP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP2" edc:desc="" edc:mask="0x1" edc:name="BRP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP3" edc:desc="" edc:mask="0x1" edc:name="BRP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP4" edc:desc="" edc:mask="0x1" edc:name="BRP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP5" edc:desc="" edc:mask="0x1" edc:name="BRP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SJW0" edc:desc="" edc:mask="0x1" edc:name="SJW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SJW1" edc:desc="" edc:mask="0x1" edc:name="SJW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="BRGCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="BRGCON2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRSEG0" edc:desc="" edc:mask="0x1" edc:name="PRSEG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRSEG1" edc:desc="" edc:mask="0x1" edc:name="PRSEG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRSEG2" edc:desc="" edc:mask="0x1" edc:name="PRSEG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1PH0" edc:desc="" edc:mask="0x1" edc:name="SEG1PH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1PH1" edc:desc="" edc:mask="0x1" edc:name="SEG1PH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1PH2" edc:desc="" edc:mask="0x1" edc:name="SEG1PH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SAM" edc:desc="" edc:mask="0x1" edc:name="SAM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2PHTS" edc:desc="" edc:mask="0x1" edc:name="SEG2PHTS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n---nnn" edc:cname="BRGCON3" edc:desc="" edc:impl="0x47" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0---000" edc:name="BRGCON3" edc:nzwidth="0x8" edc:por="-0---000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG2PH0" edc:desc="" edc:mask="0x1" edc:name="SEG2PH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2PH1" edc:desc="" edc:mask="0x1" edc:name="SEG2PH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2PH2" edc:desc="" edc:mask="0x1" edc:name="SEG2PH2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="WAKFIL" edc:desc="" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn----" edc:cname="CIOCON" edc:desc="" edc:impl="0x30" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00----" edc:name="CIOCON" edc:nzwidth="0x8" edc:por="--00----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CANCAP" edc:desc="" edc:mask="0x1" edc:name="CANCAP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENDRHI" edc:desc="" edc:mask="0x1" edc:name="ENDRHI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="ccrrrrrr" edc:cname="COMSTAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COMSTAT" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EWARN" edc:desc="" edc:mask="0x1" edc:name="EWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXWARN" edc:desc="" edc:mask="0x1" edc:name="RXWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWARN" edc:desc="" edc:mask="0x1" edc:name="TXWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBP" edc:desc="" edc:mask="0x1" edc:name="RXBP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBP" edc:desc="" edc:mask="0x1" edc:name="TXBP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBO" edc:desc="" edc:mask="0x1" edc:name="TXBO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1OVFL" edc:desc="" edc:mask="0x1" edc:name="RXB1OVFL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0OVFL" edc:desc="" edc:mask="0x1" edc:name="RXB0OVFL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RX2OVFL" edc:desc="" edc:mask="0x1" edc:name="RX2OVFL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX1OVFL" edc:desc="" edc:mask="0x1" edc:name="RX1OVFL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXERRCNT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXERRCNT" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="REC0" edc:desc="" edc:mask="0x1" edc:name="REC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REC1" edc:desc="" edc:mask="0x1" edc:name="REC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REC2" edc:desc="" edc:mask="0x1" edc:name="REC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REC3" edc:desc="" edc:mask="0x1" edc:name="REC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REC4" edc:desc="" edc:mask="0x1" edc:name="REC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REC5" edc:desc="" edc:mask="0x1" edc:name="REC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REC6" edc:desc="" edc:mask="0x1" edc:name="REC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REC7" edc:desc="" edc:mask="0x1" edc:name="REC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TXERRCNT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TXERRCNT" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TEC0" edc:desc="" edc:mask="0x1" edc:name="TEC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TEC1" edc:desc="" edc:mask="0x1" edc:name="TEC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TEC2" edc:desc="" edc:mask="0x1" edc:name="TEC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TEC3" edc:desc="" edc:mask="0x1" edc:name="TEC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TEC4" edc:desc="" edc:mask="0x1" edc:name="TEC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TEC5" edc:desc="" edc:mask="0x1" edc:name="TEC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TEC6" edc:desc="" edc:mask="0x1" edc:name="TEC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TEC7" edc:desc="" edc:mask="0x1" edc:name="TEC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
